ORTEChoiceRes/testsuites/RAD_Cancel_Request/03_Cancel_ChaiDan_Agoda_two_roomcount =1 one day/asserts/03_request_from_choiceres_to_crs_cancel.xml/03_request_from_choiceres_to_crs_cancel.1.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><OTA_HotelResNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05" Version="5.000" EchoToken="8bb5cb72-620a-4315-a44b-1410ca4f3fbd" TimeStamp="2026-09-19T14:51:29.965+08:00" ResStatus="Cancel"><POS><Source><RequestorID Type="5" ID="AGODA"/><BookingChannel Type="2"><CompanyName Code="DS"/></BookingChannel></Source></POS><HotelReservations><HotelReservation><UniqueID Type="22" ID="107464822"/><ResGlobalInfo><HotelReservationIDs><HotelReservationID ResID_Type="14" ResID_Value="46194009"/></HotelReservationIDs></ResGlobalInfo></HotelReservation></HotelReservations></OTA_HotelResNotifRQ></soap:Body></soap:Envelope>